Revit 2027 API
ParameterTypeId.RebarShapeStartHookLength Property
 "Start Hook Length"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarShapeStartHookLength { get; }
Public Shared ReadOnly Property RebarShapeStartHookLength As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarShapeStartHookLength {
	ForgeTypeId^ get ();
}
static member RebarShapeStartHookLength : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace